Сверт2.ОценкаСостоянияПредприятия/src/Documents/ПоказателиАналитики/ПоказателиАналитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоказателиАналитики</name>
  <registerRecords>InformationRegister.ПоказателяДляОценкиСостояния</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Показатели</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Сверт2.ОценкаСостоянияПредприятия/src/Documents/ПоказателиАналитики/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьПоказателяНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Показатели.Ссылка КАК Ссылка,
		|	Показатели.СтрокиБаланса КАК СтрокиБаланса
		|ИЗ
		|	Справочник.Показатели КАК Показатели
		|
		|УПОРЯДОЧИТЬ ПО
		|	Показатели.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка  = Объект.Показатели.Добавить(); 
		Строка.Показатель = Выборка.Ссылка;
		Строка.Формула = Выборка.СтрокиБаланса;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказателя(Команда)
	ЗаполнитьПоказателяНаСервере();
КонецПроцедуры
